In [1]:
#SECTION 4.5.2 HANDLE MISSING DATA
#Data set used is "missing_grades.csv"

In [2]:
# Add the Pandas dependency.
import pandas as pd

In [3]:
#Declaring a variable and assign it to the missing_grades.csv file that is located in the Resources folder.

# Files to load file_to_load is the varible
file_to_load = "Resources/missing_grades.csv"

# Read the CSV into a DataFrame missing_grade_df is the name of the dataframe and telling it to read the csv file we name "file_to_load"
missing_grade_df = pd.read_csv(file_to_load)
missing_grade_df

#When we run this cell, the empty rows will be represented by "NaN," as shown in the following image: Row 4 & 6
#NaN mean not a number and cannot be equal to zero

   Student ID       student_name gender grade  reading_score  math_score
0           0       Paul Bradley      M   9th           66.0        79.0
1           1       Victor Smith      M  12th           94.0        61.0
2           2    Kevin Rodriguez      M  12th            NaN        60.0
3           3  Dr. Richard Scott      M  12th           67.0        58.0
4           4         Bonnie Ray      F   9th           97.0        84.0
5           5      Bryan Miranda      M   9th           94.0         NaN
6           6      Sheena Carter      F  11th           82.0        80.0
7           7       Nicole Baker      F  12th           96.0        69.0

In [4]:
# We have 3 options to held missing infor 
#1. Do nothing.
#2. Drop the row that has the missing value.
#3. Fill in the row that has the missing value.

In [5]:
# Option 2 DROP DATA ROW
#Drop the row where there are NaNs, and all data associated wtih that row. 
#This can cause problems
# Drop the NaNs.
# This will change the story of the data. Ask yourself first 1. How much data would be removed if NaNs are dropped? 2. How would this impact the analysis?
#Notice that row 2 & 5 have been completely dropped
missing_grade_df.dropna()

   Student ID       student_name gender grade  reading_score  math_score
0           0       Paul Bradley      M   9th           66.0        79.0
1           1       Victor Smith      M  12th           94.0        61.0
3           3  Dr. Richard Scott      M  12th           67.0        58.0
4           4         Bonnie Ray      F   9th           97.0        84.0
6           6      Sheena Carter      F  11th           82.0        80.0
7           7       Nicole Baker      F  12th           96.0        69.0

In [6]:
# Option 3 FILL IN DATA ROW
#Dont just use 0 this can impact arithmetic calculations
#we use the fillna() method to fill in a row. If we want to fill all empty rows with zero in our DataFrame, we pass the "0" in parentheses like this: df.fillna(0).
#we will fill in the NaN with number 85
# Fill in the empty rows with "85". Look at row 2 and 5

missing_grade_df.fillna(85)

   Student ID       student_name gender grade  reading_score  math_score
0           0       Paul Bradley      M   9th           66.0        79.0
1           1       Victor Smith      M  12th           94.0        61.0
2           2    Kevin Rodriguez      M  12th           85.0        60.0
3           3  Dr. Richard Scott      M  12th           67.0        58.0
4           4         Bonnie Ray      F   9th           97.0        84.0
5           5      Bryan Miranda      M   9th           94.0        85.0
6           6      Sheena Carter      F  11th           82.0        80.0
7           7       Nicole Baker      F  12th           96.0        69.0

In [7]:
#Section 4.5.3 NEW Sections "dtypes"

In [8]:
# Determine data types for the school DataFrame.
school_data_df.dtypes

NameError: name 'school_data_df' is not defined

In [ ]:
#Using a new file and data for this section and example. "schools_complete.csv"

In [ ]:
# Files to load file_to_load is the varible
school_data_load = "Resources/schools_complete.csv"

# Read the CSV into a DataFrame missing_grade_df is the name of the dataframe and telling it to read the csv file we name "schools_complete.csv"
school_data_df = pd.read_csv(school_data_load)
school_data_df

In [ ]:
# Section 4.5.3
#DETERMINE DATA TYPES
# 6 common data types bool, int32, int64, float64, "0, object", datatime64
#If integers store values from –32,768 to 32,767, they are 16 bits or int16.
#If integer store values from –2,147,483,648 to 2,147,483,647, they are 32 bits or int32.
#If integer store values from –9,223,372,036,854,775,808 to 9,223,372,036,854,775,807, they are 64 bits, or int64.

In [9]:
#dtypes 
# Determine data types for the school DataFrame.
school_data_df.dtypes

NameError: name 'school_data_df' is not defined

In [ ]:
#also use the dtype attribute on a single column. There are two ways to perform this operation. 
#We can use df.column.dtype if the column name doesn't have any spaces in the name, like "school_name".
#If there are spaces, we must use df["column"].dtype.

In [ ]:
#NEW DATA LOAD, NOT SHOWN IN THE STUDENT READING

In [ ]:
#Using a new file and data for this section and example. "students_complete.csv"
# Files to load file_to_load is the varible
students_data_load = "Resources/students_complete.csv"

# Read the CSV into a DataFrame missing_grade_df is the name of the dataframe and telling it to read the csv file we name "schools_complete.csv"
student_data_df = pd.read_csv(students_data_load)
student_data_df

In [ ]:
# Now we looking at the "student data frame"
# Determine data types for the student DataFrame.
student_data_df.dtypes